04_Theorem_Proving_in_Lean.org
#+Title: An Introduction to Lean
#+Author: [[http://www.andrew.cmu.edu/user/avigad][Jeremy Avigad]], [[http://leodemoura.github.io][Leonardo de Moura]], [[https://gebner.org/][Gabriel Ebner]], and Sebastian Ullrich

* Theorem Proving in Lean
:PROPERTIES:
  :CUSTOM_ID: Theorem_Proving_in_Lean
:END:

** Assertions in Dependent Type Theory

We have seen that dependent type theory is flexible enough to encode a
broad array of data types and objects. A simple device makes it
possible to encode any assertion you might want to make, as well:
there is a type =Prop=, whose elements are taken to be
propositions. The usual logical connectives are simply functions that
take propositions and return a proposition.
#+BEGIN_SRC lean
variables p q r : Prop

check and  -- Prop → Prop → Prop
check or   -- Prop → Prop → Prop
check not  -- Prop → Prop

check p ∧ (p → r)
check p ∧ ¬ (q ∨ ¬ r)
#+END_SRC
There is no corresponding constant for implication: if =p= and =q= are
propositions, the arrow in =p → q= is in fact an instance of the arrow
used to construct function spaces. We will return to this in the next
section.

A predicate on a type =α= is a function from =α= to =Prop=, and a
binary relation on =α= is a function that takes two arguments in =α=
and returns an element of =Prop=. 
#+BEGIN_SRC lean
variables p q : ℕ → Prop
variable  r : ℕ → ℕ → Prop
variables m n : ℕ

check p m ∧ q n
check p m ∧ ¬ r m n → q n 

check ∀ x, p x → q x
check ∀ x, ∃ y, r x y
#+END_SRC 
The universal quantifier is really an instance of the dependent
function space construction; again, more on this in the next
section. Lean notation supports bounded quantifiers:
#+BEGIN_SRC lean
variables p q : ℕ → Prop
variable  n : ℕ

-- BEGIN
check ∀ x ≤ n, p x → q x 

variables (α : Type) (s t : list α) (a b : α) 

check ∀ x ∈ s, x ∈ t
-- END
#+END_SRC
With these resources, we can start writing substantial mathematical
assertions:
#+BEGIN_SRC lean
namespace nat

def pow (n : ℕ) : ℕ → ℕ
| 0       := 1
| (m + 1) := n * pow m

infix ` ^ ` := pow

-- BEGIN
def dvd (m n : ℕ) : Prop := ∃ k, n = m * k

instance : has_dvd ℕ := ⟨dvd⟩

def even (n : ℕ) : Prop := 2 ∣ n

def prime (p : ℕ) : Prop := p ≥ 2 ∧ ∀ n, n ∣ p → n = 1 ∨ n = p

def Fermat : Prop := ∀ n > 2, ∀ (a b c : ℕ), a ≠ 0 → b ≠ 0 → a^n + b^n ≠ c^n

def Goldbach : Prop := ∀ n > 2, even n → ∃ p q, prime p ∧ prime q ∧ n = p + q

def twin_primes : Prop := ∀ n, ∃ p > n, prime p ∧ prime (p + 2)
-- END
end nat
#+END_SRC
Of course, what we really want are means to /prove/ such assertions,
which is what we turn to next.

