04_Theorem_Proving_in_Lean.org
** Propositions as Types

Given the expressive power of dependent type theory, it should by now
not be too surprisingly that the language is rich enough to encode
proofs as well. In fact, the CIC employs a device known as the
=Curry-Howard isomorphism=, or =propositions as types=, that makes
writing and checking proofs especially convenient. Remember that if
=φ= is any expression of type =Prop=, we are thinking of =φ= as a
proposition, or an assertion. In that case, we think of an term =t :
φ= as being a proof of =φ=. The rules of CIC support this
interpretation: given =t : φ → ψ= and =s : φ=, then =t s : ψ=
describes the result of using modus ponens. To construct a proof of =φ
→ ψ=, it suffices to construct a proof of =t : ψ=, assuming
hypothetically =x : φ=. The resulting proof is written =λ x, t=, which
is to say, the proof is an instance of lambda abstraction.

Similar considerations hold of the universal quantifier. The net
effect is that we can use the same notation we use for function
application to apply theorems to parameters and hypotheses. For
example, the theorem =and.left= in the standard library has the
following type:
#+BEGIN_SRC lean_text
∀ {a b : Prop}, a ∧ b → a
#+END_SRC
Notice that the arguments =a= and =b= are implicit. This means that if
=h= is any expression of the form =a ∧ b=, then =and.left h : a= is a
proof of =a=. Similarly, =add_comm=, which expresses the commutativity
of addition for any type that can be seen as an instance of an
additive, commutative semigroup has the following type
#+BEGIN_SRC lean_text
∀ {α : Type u} [s : add_comm_semigroup α] (a b : α), a + b = b + a
#+END_SRC
The second argument, that is, the relevant algebraic structure, is
inferred by class inference. Given, say, =m n : ℕ=, the expression
=add_comm m n= then represents the fact that =m + n = n + m=.

Now the task of proving a proposition boils down to the task of
constructing an expression of the right type, and Lean is designed to
help us do this. We can provide such an expression explicitly:
#+BEGIN_SRC lean
example (a b : Prop) : a ∧ b → b ∧ a :=
λ h, and.intro (and.right h) (and.left h)
#+END_SRC
We can use projections and anonymous constructors to express the proof
even more concisely, though somewhat cryptically:
#+BEGIN_SRC lean
example (a b : Prop) : a ∧ b → b ∧ a :=
λ h, ⟨h^.right, h^.left⟩
#+END_SRC
In the opposite direction, Lean provides syntactic sugar that allows
us to annotation assumptions and goals, and build a proof
incrementally:
#+BEGIN_SRC lean
example (a b : Prop) : a ∧ b → b ∧ a :=
assume h : a ∧ b, 
have ha : a, from and.left h,
have hb : b, from and.right h,
show b ∧ a, from and.intro hb ha
#+END_SRC

You can write proofs incrementally using =sorry= to temporarily fill
in any intermediate step.
#+BEGIN_SRC lean
example (a b : Prop) : a ∧ b → b ∧ a :=
assume h : a ∧ b, 
have ha : a, from sorry,
have hb : b, from sorry,
show b ∧ a, from and.intro hb ha
#+END_SRC
Lean notices that you are cheating, but will otherwise confirm that
the proof is correct modulo the instances of =sorry=. Replacing one of
them by an underscore tells Lean that it should infer the value of
that expression. Lean's elaborator will not prove propositions for us
without explicit instructions to do so, but the error message will show
you exactly what needs to be proved, and what hypotheses are
available.

Lean supports the use of =tactics=, which are instructions which tell
the system how to construct a term or proof.
#+BEGIN_SRC lean
example (a b : Prop) : a ∧ b → b ∧ a :=
begin 
  intro h, cases h, split, 
  repeat { assumption } 
end
#+END_SRC
These commands can be used to invoke automation, like the simplifier:
#+BEGIN_SRC lean
example (a b : Prop) : a ∧ b → b ∧ a :=
begin intro, simp_using_hs end
#+END_SRC
We can also invoke a superposition theorem prover:
#+BEGIN_SRC lean
import tools.super

example (a b : Prop) : a ∧ b → b ∧ a :=
by super
#+END_SRC

Anywhere Lean's parser expects an expression, you can enter tactic
mode with a =begin ... end= block, or with the =by= keyword. 
#+BEGIN_SRC lean
example (a b : Prop) : a ∧ b → b ∧ a :=
assume h : a ∧ b, 
have ha : a, from h^.left,
have hb : b, from h^.right,
show b ∧ a, 
  begin split, repeat { assumption } end
#+END_SRC
Conversely, in a =begin ... end= block, Lean provides various ways of
specifying an explicit term:
#+BEGIN_SRC lean
example (a b : Prop) : a ∧ b → b ∧ a :=
begin 
  intro h, cases h with ha hb,
  show b ∧ a, from and.intro hb ha
end
#+END_SRC
We can even pass back and forth between the two modes freely:
#+BEGIN_SRC lean
example (a b : Prop) : a ∧ b → b ∧ a :=
begin 
  intro h, cases h with ha hb,
  show b ∧ a, from and.intro (by assumption) (by assumption)
end
#+END_SRC
This lets us write proofs in a manner that lays out the structure
explicitly and provides briefer hints and instructions where
appropriate, just as in an ordinary mathematical proof.

When writing proof terms explicitly, Lean provides the word =suppose=
to introduce an assumption without a label, and the label can be
ommitted in the =have= command as well. In this case, we can refer to
the anonymous fact that was most recently added to the context with
the keyword =this=. We can also refer to them by surrounding the
statement of the proposition with French quotes, obtained by typing
=\f<= and =\f>=.
#+BEGIN_SRC lean
example (a b : Prop) : a ∧ b → b ∧ a :=
suppose a ∧ b,
have a, from this^.left,
have b, from ‹a ∧ b›^.right,
show b ∧ a, from and.intro ‹b› ‹a› 
#+END_SRC
These anonymous elements of the context are also visible to tactics
and automation:
#+BEGIN_SRC lean
example (a b : Prop) : a ∧ b → b ∧ a :=
suppose a ∧ b,
have a, from this^.left,
have b, from ‹a ∧ b›^.right,
show b ∧ a, begin split, repeat { assumption } end

example (a b : Prop) : a ∧ b → b ∧ a :=
suppose a ∧ b,
have a, from this^.left,
have b, from ‹a ∧ b›^.right,
show b ∧ a, by simp_using_hs
#+END_SRC

