04_Theorem_Proving_in_Lean.html

<div id="outline-container-orgc1ebe89" class="outline-3">
<h3 id="orgc1ebe89"><span class="section-number-3"> 4.2</span> Propositions as Types</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Given the expressive power of dependent type theory, it should by now
not be too surprisingly that the language is rich enough to encode
proofs as well. In fact, the CIC employs a device known as the
<code>Curry-Howard isomorphism</code>, or <code>propositions as types</code>, that makes
writing and checking proofs especially convenient. Remember that if
<code>φ</code> is any expression of type <code>Prop</code>, we are thinking of <code>φ</code> as a
proposition, or an assertion. In that case, we think of an term <code>t :
φ</code> as being a proof of <code>φ</code>. The rules of CIC support this
interpretation: given <code>t : φ → ψ</code> and <code>s : φ</code>, then <code>t s : ψ</code>
describes the result of using modus ponens. To construct a proof of <code>φ
→ ψ</code>, it suffices to construct a proof of <code>t : ψ</code>, assuming
hypothetically <code>x : φ</code>. The resulting proof is written <code>λ x, t</code>, which
is to say, the proof is an instance of lambda abstraction.
</p>

<p>
Similar considerations hold of the universal quantifier. The net
effect is that we can use the same notation we use for function
application to apply theorems to parameters and hypotheses. For
example, the theorem <code>and.left</code> in the standard library has the
following type:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-5' mode="ace/mode/lean" readonly="true">∀ {a b : Prop}, a ∧ b → a
</juicy-ace-editor><div id='lean-full-code-5' style='display:none'>∀ {a b : Prop}, a ∧ b → a
</div>
</div>
<p>
Notice that the arguments <code>a</code> and <code>b</code> are implicit. This means that if
<code>h</code> is any expression of the form <code>a ∧ b</code>, then <code>and.left h : a</code> is a
proof of <code>a</code>. Similarly, <code>add_comm</code>, which expresses the commutativity
of addition for any type that can be seen as an instance of an
additive, commutative semigroup has the following type
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-6' mode="ace/mode/lean" readonly="true">∀ {α : Type u} [s : add_comm_semigroup α] (a b : α), a + b = b + a
</juicy-ace-editor><div id='lean-full-code-6' style='display:none'>∀ {α : Type u} [s : add_comm_semigroup α] (a b : α), a + b = b + a
</div>
</div>
<p>
The second argument, that is, the relevant algebraic structure, is
inferred by class inference. Given, say, <code>m n : ℕ</code>, the expression
<code>add_comm m n</code> then represents the fact that <code>m + n = n + m</code>.
</p>

<p>
Now the task of proving a proposition boils down to the task of
constructing an expression of the right type, and Lean is designed to
help us do this. We can provide such an expression explicitly:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-7' mode="ace/mode/lean" readonly="true">example (a b : Prop) : a ∧ b → b ∧ a :=
λ h, and.intro (and.right h) (and.left h)
</juicy-ace-editor><div id='lean-full-code-7' style='display:none'>example (a b : Prop) : a ∧ b → b ∧ a :=
λ h, and.intro (and.right h) (and.left h)
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-7').text());">Try it yourself &raquo;</button></div>
</div>
<p>
We can use projections and anonymous constructors to express the proof
even more concisely, though somewhat cryptically:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-8' mode="ace/mode/lean" readonly="true">example (a b : Prop) : a ∧ b → b ∧ a :=
λ h, ⟨h.right, h.left⟩
</juicy-ace-editor><div id='lean-full-code-8' style='display:none'>example (a b : Prop) : a ∧ b → b ∧ a :=
λ h, ⟨h.right, h.left⟩
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-8').text());">Try it yourself &raquo;</button></div>
</div>
<p>
In the opposite direction, Lean provides syntactic sugar that allows
us to annotation assumptions and goals, and build a proof
incrementally:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-9' mode="ace/mode/lean" readonly="true">example (a b : Prop) : a ∧ b → b ∧ a :=
assume h : a ∧ b, 
have ha : a, from and.left h,
have hb : b, from and.right h,
show b ∧ a, from and.intro hb ha
</juicy-ace-editor><div id='lean-full-code-9' style='display:none'>example (a b : Prop) : a ∧ b → b ∧ a :=
assume h : a ∧ b, 
have ha : a, from and.left h,
have hb : b, from and.right h,
show b ∧ a, from and.intro hb ha
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-9').text());">Try it yourself &raquo;</button></div>
</div>

<p>
You can write proofs incrementally using <code>sorry</code> to temporarily fill
in any intermediate step.
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-10' mode="ace/mode/lean" readonly="true">example (a b : Prop) : a ∧ b → b ∧ a :=
assume h : a ∧ b, 
have ha : a, from sorry,
have hb : b, from sorry,
show b ∧ a, from and.intro hb ha
</juicy-ace-editor><div id='lean-full-code-10' style='display:none'>example (a b : Prop) : a ∧ b → b ∧ a :=
assume h : a ∧ b, 
have ha : a, from sorry,
have hb : b, from sorry,
show b ∧ a, from and.intro hb ha
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-10').text());">Try it yourself &raquo;</button></div>
</div>
<p>
Lean notices that you are cheating, but will otherwise confirm that
the proof is correct modulo the instances of <code>sorry</code>. Replacing one of
them by an underscore tells Lean that it should infer the value of
that expression. Lean's elaborator will not prove propositions for us
without explicit instructions to do so, but the error message will show
you exactly what needs to be proved, and what hypotheses are
available.
</p>

<p>
Lean supports the use of <code>tactics</code>, which are instructions which tell
the system how to construct a term or proof.
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-11' mode="ace/mode/lean" readonly="true">example (a b : Prop) : a ∧ b → b ∧ a :=
begin 
  intro h, cases h, split, 
  repeat { assumption } 
end
</juicy-ace-editor><div id='lean-full-code-11' style='display:none'>example (a b : Prop) : a ∧ b → b ∧ a :=
begin 
  intro h, cases h, split, 
  repeat { assumption } 
end
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-11').text());">Try it yourself &raquo;</button></div>
</div>
<p>
These commands can be used to invoke automation, like the simplifier:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-12' mode="ace/mode/lean" readonly="true">example (a b : Prop) : a ∧ b → b ∧ a :=
begin intro, simp_using_hs end
</juicy-ace-editor><div id='lean-full-code-12' style='display:none'>example (a b : Prop) : a ∧ b → b ∧ a :=
begin intro, simp_using_hs end
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-12').text());">Try it yourself &raquo;</button></div>
</div>

<p>
Anywhere Lean's parser expects an expression, you can enter tactic
mode with a <code>begin ... end</code> block, or with the <code>by</code> keyword. 
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-13' mode="ace/mode/lean" readonly="true">example (a b : Prop) : a ∧ b → b ∧ a :=
assume h : a ∧ b, 
have ha : a, from h.left,
have hb : b, from h.right,
show b ∧ a, 
  begin split, repeat { assumption } end
</juicy-ace-editor><div id='lean-full-code-13' style='display:none'>example (a b : Prop) : a ∧ b → b ∧ a :=
assume h : a ∧ b, 
have ha : a, from h.left,
have hb : b, from h.right,
show b ∧ a, 
  begin split, repeat { assumption } end
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-13').text());">Try it yourself &raquo;</button></div>
</div>
<p>
Conversely, in a <code>begin ... end</code> block, Lean provides various ways of
specifying an explicit term:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-14' mode="ace/mode/lean" readonly="true">example (a b : Prop) : a ∧ b → b ∧ a :=
begin 
  intro h, cases h with ha hb,
  exact and.intro hb ha
end
</juicy-ace-editor><div id='lean-full-code-14' style='display:none'>example (a b : Prop) : a ∧ b → b ∧ a :=
begin 
  intro h, cases h with ha hb,
  exact and.intro hb ha
end
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-14').text());">Try it yourself &raquo;</button></div>
</div>
<p>
We can even pass back and forth between the two modes freely:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-15' mode="ace/mode/lean" readonly="true">example (a b : Prop) : a ∧ b → b ∧ a :=
begin 
  intro h, cases h with ha hb,
  exact and.intro (by assumption) (by assumption)
end
</juicy-ace-editor><div id='lean-full-code-15' style='display:none'>example (a b : Prop) : a ∧ b → b ∧ a :=
begin 
  intro h, cases h with ha hb,
  exact and.intro (by assumption) (by assumption)
end
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-15').text());">Try it yourself &raquo;</button></div>
</div>
<p>
This lets us write proofs in a manner that lays out the structure
explicitly and provides briefer hints and instructions where
appropriate, just as in an ordinary mathematical proof.
</p>

<p>
When writing proof terms explicitly, Lean provides the word <code>suppose</code>
to introduce an assumption without a label, and the label can be
ommitted in the <code>have</code> command as well. In this case, we can refer to
the anonymous fact that was most recently added to the context with
the keyword <code>this</code>. We can also refer to them by surrounding the
statement of the proposition with French quotes, obtained by typing
<code>\f&lt;</code> and <code>\f&gt;</code>.
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-16' mode="ace/mode/lean" readonly="true">example (a b : Prop) : a ∧ b → b ∧ a :=
suppose a ∧ b,
have a, from this.left,
have b, from ‹a ∧ b›.right,
show b ∧ a, from and.intro ‹b› ‹a›
</juicy-ace-editor><div id='lean-full-code-16' style='display:none'>example (a b : Prop) : a ∧ b → b ∧ a :=
suppose a ∧ b,
have a, from this.left,
have b, from ‹a ∧ b›.right,
show b ∧ a, from and.intro ‹b› ‹a›
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-16').text());">Try it yourself &raquo;</button></div>
</div>
<p>
These anonymous elements of the context are also visible to tactics
and automation:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-17' mode="ace/mode/lean" readonly="true">example (a b : Prop) : a ∧ b → b ∧ a :=
suppose a ∧ b,
have a, from this.left,
have b, from ‹a ∧ b›.right,
show b ∧ a, begin split, repeat { assumption } end

example (a b : Prop) : a ∧ b → b ∧ a :=
suppose a ∧ b,
have a, from this.left,
have b, from ‹a ∧ b›.right,
show b ∧ a, by simp_using_hs
</juicy-ace-editor><div id='lean-full-code-17' style='display:none'>example (a b : Prop) : a ∧ b → b ∧ a :=
suppose a ∧ b,
have a, from this.left,
have b, from ‹a ∧ b›.right,
show b ∧ a, begin split, repeat { assumption } end

example (a b : Prop) : a ∧ b → b ∧ a :=
suppose a ∧ b,
have a, from this.left,
have b, from ‹a ∧ b›.right,
show b ∧ a, by simp_using_hs
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-17').text());">Try it yourself &raquo;</button></div>
</div>
</div>
</div>
