04_Theorem_Proving_in_Lean.org
** Axioms

[To do: describe all the axioms of Lean, including classical axioms.]
