04_Theorem_Proving_in_Lean.html

<div id="outline-container-org7d8fa6a" class="outline-3">
<h3 id="org7d8fa6a"><span class="section-number-3"> 4.4</span> Axioms</h3>
<div class="outline-text-3" id="text-1-4">
<p>
[To do: describe all the axioms of Lean, including classical axioms.]
</p>
</div>
</div>
</div>
</div>
</body>
</html>
